status/2023/0630.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-01 Sat 09:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>24 June 2023 - 30 June 2023</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">24 June 2023 - 30 June 2023</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org141010a">1. MIT OCW</a>
<ul>
<li><a href="#orga9e6b6c">1.1. 18.03sc (differential equations).</a>
<ul>
<li><a href="#org4e4665b">1.1.1. Unit II - Undetermined Coefficients</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcf805b0">2. San Jose fence</a>
<ul>
<li><a href="#org011abf0">2.1. 95% Complete.</a></li>
</ul>
</li>
<li><a href="#orge00bfa7">3. wktcolor</a></li>
<li><a href="#org75320a7">4. wktpqb</a></li>
<li><a href="#orgdfea00b">5. Compilers</a>
<ul>
<li><a href="#org246c20a">5.1. Started hand written WSN parser</a></li>
</ul>
</li>
<li><a href="#org249a84e">6. Mill Controller #2</a>
<ul>
<li><a href="#org7bf5e6a">6.1. Mounted on mill - ready or testing</a></li>
<li><a href="#org2b0ede2">6.2. Need to investigate new HW/SW for eventual replacements</a>
<ul>
<li><a href="#orgfed2bc5">6.2.1. Old crap ain't gonna last forever</a></li>
<li><a href="#orgd069e08">6.2.2. Buildroot/Linux 5.15 PREEMPT + latency tools</a></li>
</ul>
</li>
<li><a href="#org8981a07">6.3. Alternative architecture</a>
<ul>
<li><a href="#org3e2a1a4">6.3.1. Split off stepper motor controller to separate board</a></li>
<li><a href="#org2d98440">6.3.2. Use emc2 MODBUS/TCP protocol for stepper and other IO</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org77453a6">7. Alum Rock Data Center</a>
<ul>
<li><a href="#org7fbf946">7.1. need to check rocky, others? (arch?) for suitability</a></li>
<li><a href="#org5703a62">7.2. recheck ALMA, now that CERN and Fermilab are using it</a></li>
<li><a href="#orgc6a369c">7.3. Sonic.net has announced that Fiber connectivity is coming to my house</a></li>
<li><a href="#org4b97df3">7.4. The end of DSL and static IP addresses as I know it</a></li>
<li><a href="#org989f06c">7.5. Need a VPS with static IP</a>
<ul>
<li><a href="#org75c5cd3">7.5.1. OpenVPN to tie it all together</a></li>
<li><a href="#org37827d9">7.5.2. Gandi VPS datacenter in France so connection crosses international border</a></li>
<li><a href="#orgc6b79b9">7.5.3. Prototype VPS on existing hardware</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org29798ab">8. CA Root Key Generation</a>
<ul>
<li><a href="#org4a67431">8.1. Need to be clear on security properties.</a></li>
<li><a href="#orga6b5ea9">8.2. Simple hardware.</a></li>
<li><a href="#orgca368af">8.3. USB Serial interface only but no credentials across USB I/F.</a></li>
<li><a href="#org6608d33">8.4. Use Sneakernet</a></li>
<li><a href="#org01fca7a">8.5. Beagleboard</a></li>
<li><a href="#orgd55d5c1">8.6. LCD Touchscreen</a></li>
<li><a href="#orgc99b2bd">8.7. Morse code PIN</a></li>
<li><a href="#org5cc184c">8.8. Encrypted Filesystem</a></li>
</ul>
</li>
<li><a href="#org68c3946">9. Virtual Orchestra</a>
<ul>
<li><a href="#orgeab99d0">9.1. sfz file tests</a>
<ul>
<li><a href="#org632624b">9.1.1. need tooling to edit sample files</a></li>
</ul>
</li>
<li><a href="#org9b5a2a3">9.2. increasingly skeptical whether quality results are possible</a></li>
<li><a href="#org1a14555">9.3. maybe should treat as platform for concatinative synthesis</a></li>
<li><a href="#org7637faf">9.4. maybe should just accept the limitations and work with it</a></li>
</ul>
</li>
<li><a href="#org33be7b3">10. gat</a>
<ul>
<li><a href="#org9b579f9">10.1. spectrogram done - matches 'octave' output</a></li>
</ul>
</li>
<li><a href="#org478a0db">11. RIOT drivers</a>
<ul>
<li><a href="#org002dd5d">11.1. WS2801</a></li>
<li><a href="#orgb394b03">11.2. Velleman KA03</a></li>
<li><a href="#org8009187">11.3. Velleman KA05</a></li>
</ul>
</li>
<li><a href="#org7646f39">12. mcd05 32 button/led box</a>
<ul>
<li><a href="#org9ad4a54">12.1. Recovered schematics.</a></li>
<li><a href="#org00137c3">12.2. Planning software.</a></li>
<li><a href="#orgb4c551b">12.3. Received STM32F767 Nucleo144 with Ethernet.</a>
<ul>
<li><a href="#org85d33fb">12.3.1. Test program running.</a></li>
<li><a href="#org55f41c0">12.3.2. Need to consider CoAP multicast discovery.</a></li>
<li><a href="#org9bf6f39">12.3.3. Consider simpler architecture with STM32F767 as a 'hub'.</a></li>
<li><a href="#org365a26e">12.3.4. Consider CAN interface to hub.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge7189fd">13. AMD 2900 bitslice computing</a>
<ul>
<li><a href="#org9264855">13.1. Probably my oldest uncompleted project</a></li>
<li><a href="#org9b3aa6f">13.2. Exploring possibilities for something constructive</a></li>
</ul>
</li>
<li><a href="#org55d5ce3">14. Hitachi HD68B09E CPU</a>
<ul>
<li><a href="#org026984a">14.1. RAM/UART/IO</a></li>
<li><a href="#orgc53c560">14.2. Started schematic</a>
<ul>
<li><a href="#orgd1e4d16">14.2.1. Standard peripheral set for 8 bit CPU bringups</a></li>
</ul>
</li>
<li><a href="#orgecbc9b9">14.3. Arduino Mega 2560 DMA loader</a></li>
<li><a href="#orge470d43">14.4. Generate quadrature clock directly</a></li>
<li><a href="#org157506b">14.5. Full Bus SW Emulation infeasible</a></li>
</ul>
</li>
<li><a href="#orge8ac6d2">15. Rockwell R65F11</a>
<ul>
<li><a href="#orgd6d25ef">15.1. Still evaluating.</a></li>
<li><a href="#org11f55c1">15.2. Dev board</a></li>
</ul>
</li>
<li><a href="#org030f1c9">16. PLD programming</a></li>
<li><a href="#org25bdf4a">17. EPROM Programming</a></li>
<li><a href="#org2f5f362">18. POSIT</a></li>
<li><a href="#orge3fd864">19. MAME</a>
<ul>
<li><a href="#orgec42160">19.1. Subset builds in debug mode</a></li>
<li><a href="#orgb2b9527">19.2. gs6809 serial IO doesn't work right with PTY and other streams</a></li>
<li><a href="#org52c0e25">19.3. ampro (Z80/Z80SIO) <b>does</b> work with PTY</a></li>
<li><a href="#org36e9cd0">19.4. Evaluating what is needed for other emulators.</a></li>
</ul>
</li>
<li><a href="#org7d4dbe6">20. More project ideas</a>
<ul>
<li><a href="#org1e906f5">20.1. Zuse Z3 simulation in Verilog</a></li>
<li><a href="#org75335fd">20.2. GMPForth ports to simulators</a>
<ul>
<li><a href="#orgd3ca12a">20.2.1. SIMH for some targets (vax)</a></li>
<li><a href="#orga499546">20.2.2. MAME looks interesting for microprocessor system emulations</a></li>
<li><a href="#org3e653b2">20.2.3. Ports to classic figFORTH targets</a></li>
</ul>
</li>
<li><a href="#orga91eada">20.3. GMPASM assembler</a></li>
<li><a href="#org0d37e91">20.4. Extracting ISO Superboard Forth ROMS for MAME emulation</a></li>
<li><a href="#org1f79a3b">20.5. 'bwocl' OpenCL tooling</a>
<ul>
<li><a href="#orgc5ba745">20.5.1. Offline compilation</a></li>
<li><a href="#org9ce0264">20.5.2. Standard Kernel Running</a></li>
</ul>
</li>
<li><a href="#org4ec71c2">20.6. hardware support for classic 5V CPUs</a>
<ul>
<li><a href="#org2e25e84">20.6.1. RTX2000, CDP1802 still available!</a></li>
<li><a href="#org5358f8e">20.6.2. 6502, 68000, 320C30, others on hand</a></li>
<li><a href="#orgbeb4556">20.6.3. CPUs with totally async bus may be supportable without RAM</a></li>
<li><a href="#org06e6c89">20.6.4. Could use small footprint monitor in asm (gmpmon?)</a></li>
</ul>
</li>
<li><a href="#org4e0742c">20.7. Existing 'retro' hardware still working?</a>
<ul>
<li><a href="#org44d0515">20.7.1. OSI Superboard</a></li>
<li><a href="#orgac44ffa">20.7.2. Super Jolt</a></li>
<li><a href="#org548dabd">20.7.3. Ampro Little Board</a></li>
<li><a href="#org1a2f127">20.7.4. Rockwell R65F11 Demo board</a></li>
<li><a href="#orga8db964">20.7.5. NMIX-0016</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8f4d9f2">21. David Davies</a>
<ul>
<li><a href="#orgb232b5b">21.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#orgf5b7986">21.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org73249d8">21.3. Next hearing 6/20/2023</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org141010a" class="outline-2">
<h2 id="org141010a"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orga9e6b6c" class="outline-3">
<h3 id="orga9e6b6c"><span class="section-number-3">1.1.</span> 18.03sc (differential equations).</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org4e4665b" class="outline-4">
<h4 id="org4e4665b"><span class="section-number-4">1.1.1.</span> Unit II - Undetermined Coefficients</h4>
</div>
</div>
</div>
<div id="outline-container-orgcf805b0" class="outline-2">
<h2 id="orgcf805b0"><span class="section-number-2">2.</span> San Jose fence</h2>
<div class="outline-text-2" id="text-2">
<p>
North property line fence blew over in March windstorm.
</p>
</div>
<div id="outline-container-org011abf0" class="outline-3">
<h3 id="org011abf0"><span class="section-number-3">2.1.</span> 95% Complete.</h3>
</div>
</div>
<div id="outline-container-orge00bfa7" class="outline-2">
<h2 id="orge00bfa7"><span class="section-number-2">3.</span> wktcolor</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://github.com/daniel-kelley/wktcolor/issues/10">https://github.com/daniel-kelley/wktcolor/issues/10</a>
</p>
</div>
</div>
<div id="outline-container-org75320a7" class="outline-2">
<h2 id="org75320a7"><span class="section-number-2">4.</span> wktpqb</h2>
<div class="outline-text-2" id="text-4">
<p>
Understanding dihedral groups (D<sub>3,D</sub><sub>4,D</sub><sub>6</sub>).
</p>
</div>
</div>
<div id="outline-container-orgdfea00b" class="outline-2">
<h2 id="orgdfea00b"><span class="section-number-2">5.</span> Compilers</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org246c20a" class="outline-3">
<h3 id="org246c20a"><span class="section-number-3">5.1.</span> Started hand written WSN parser</h3>
</div>
</div>
<div id="outline-container-org249a84e" class="outline-2">
<h2 id="org249a84e"><span class="section-number-2">6.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org7bf5e6a" class="outline-3">
<h3 id="org7bf5e6a"><span class="section-number-3">6.1.</span> Mounted on mill - ready or testing</h3>
</div>
<div id="outline-container-org2b0ede2" class="outline-3">
<h3 id="org2b0ede2"><span class="section-number-3">6.2.</span> Need to investigate new HW/SW for eventual replacements</h3>
<div class="outline-text-3" id="text-6-2">
</div>
<div id="outline-container-orgfed2bc5" class="outline-4">
<h4 id="orgfed2bc5"><span class="section-number-4">6.2.1.</span> Old crap ain't gonna last forever</h4>
</div>
<div id="outline-container-orgd069e08" class="outline-4">
<h4 id="orgd069e08"><span class="section-number-4">6.2.2.</span> Buildroot/Linux 5.15 PREEMPT + latency tools</h4>
<div class="outline-text-4" id="text-6-2-2">
<p>
First pass done - boots on real hardware
</p>
</div>
</div>
</div>
<div id="outline-container-org8981a07" class="outline-3">
<h3 id="org8981a07"><span class="section-number-3">6.3.</span> Alternative architecture</h3>
<div class="outline-text-3" id="text-6-3">
</div>
<div id="outline-container-org3e2a1a4" class="outline-4">
<h4 id="org3e2a1a4"><span class="section-number-4">6.3.1.</span> Split off stepper motor controller to separate board</h4>
<div class="outline-text-4" id="text-6-3-1">
<p>
Increase latency tolerance on controller
</p>
</div>
</div>
<div id="outline-container-org2d98440" class="outline-4">
<h4 id="org2d98440"><span class="section-number-4">6.3.2.</span> Use emc2 MODBUS/TCP protocol for stepper and other IO</h4>
</div>
</div>
</div>
<div id="outline-container-org77453a6" class="outline-2">
<h2 id="org77453a6"><span class="section-number-2">7.</span> Alum Rock Data Center</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org7fbf946" class="outline-3">
<h3 id="org7fbf946"><span class="section-number-3">7.1.</span> need to check rocky, others? (arch?) for suitability</h3>
</div>
<div id="outline-container-org5703a62" class="outline-3">
<h3 id="org5703a62"><span class="section-number-3">7.2.</span> recheck ALMA, now that CERN and Fermilab are using it</h3>
</div>
<div id="outline-container-orgc6a369c" class="outline-3">
<h3 id="orgc6a369c"><span class="section-number-3">7.3.</span> Sonic.net has announced that Fiber connectivity is coming to my house</h3>
</div>
<div id="outline-container-org4b97df3" class="outline-3">
<h3 id="org4b97df3"><span class="section-number-3">7.4.</span> The end of DSL and static IP addresses as I know it</h3>
<div class="outline-text-3" id="text-7-4">
<p>
Started with Northpoint communications in the late 1990's. I guess
that's a good long run.
</p>
</div>
</div>
<div id="outline-container-org989f06c" class="outline-3">
<h3 id="org989f06c"><span class="section-number-3">7.5.</span> Need a VPS with static IP</h3>
<div class="outline-text-3" id="text-7-5">
</div>
<div id="outline-container-org75c5cd3" class="outline-4">
<h4 id="org75c5cd3"><span class="section-number-4">7.5.1.</span> OpenVPN to tie it all together</h4>
</div>
<div id="outline-container-org37827d9" class="outline-4">
<h4 id="org37827d9"><span class="section-number-4">7.5.2.</span> Gandi VPS datacenter in France so connection crosses international border</h4>
<div class="outline-text-4" id="text-7-5-2">
<p>
What are the data security and privacy tradeoffs?
</p>
</div>
</div>
<div id="outline-container-orgc6b79b9" class="outline-4">
<h4 id="orgc6b79b9"><span class="section-number-4">7.5.3.</span> Prototype VPS on existing hardware</h4>
</div>
</div>
</div>
<div id="outline-container-org29798ab" class="outline-2">
<h2 id="org29798ab"><span class="section-number-2">8.</span> CA Root Key Generation</h2>
<div class="outline-text-2" id="text-8">
<p>
Nice to have an appliance that manages keys.
Could just buy something from nitrokey <a href="https://www.nitrokey.com/">https://www.nitrokey.com/</a>
</p>
</div>
