status/2023/0630.html
<div id="outline-container-org4a67431" class="outline-3">
<h3 id="org4a67431"><span class="section-number-3">8.1.</span> Need to be clear on security properties.</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Definitely protect against remote access to private keys. How strong
does the protection against <b>local</b> access need to be?
</p>
</div>
</div>
<div id="outline-container-orga6b5ea9" class="outline-3">
<h3 id="orga6b5ea9"><span class="section-number-3">8.2.</span> Simple hardware.</h3>
</div>
<div id="outline-container-orgca368af" class="outline-3">
<h3 id="orgca368af"><span class="section-number-3">8.3.</span> USB Serial interface only but no credentials across USB I/F.</h3>
<div class="outline-text-3" id="text-8-3">
<p>
But this potentially exposes the hardware to remote access via the USB
I/F when connected.
</p>
</div>
</div>
<div id="outline-container-org6608d33" class="outline-3">
<h3 id="org6608d33"><span class="section-number-3">8.4.</span> Use Sneakernet</h3>
<div class="outline-text-3" id="text-8-4">
<p>
Using "disk drive" IO introduces air gap - remote access <b>impossible</b>.
Increases attack surface via filesystem manipulation.
</p>
</div>
</div>
<div id="outline-container-org01fca7a" class="outline-3">
<h3 id="org01fca7a"><span class="section-number-3">8.5.</span> Beagleboard</h3>
<div class="outline-text-3" id="text-8-5">
<p>
Found in SCZ. Thought it was in SJ.
</p>
</div>
</div>
<div id="outline-container-orgd55d5c1" class="outline-3">
<h3 id="orgd55d5c1"><span class="section-number-3">8.6.</span> LCD Touchscreen</h3>
<div class="outline-text-3" id="text-8-6">
<p>
Unlocks encrypted filesystem. Maybe not needed. See below.
</p>
</div>
</div>
<div id="outline-container-orgc99b2bd" class="outline-3">
<h3 id="orgc99b2bd"><span class="section-number-3">8.7.</span> Morse code PIN</h3>
<div class="outline-text-3" id="text-8-7">
<p>
Only need ONE button, and a pass/fail LED. Hardware will never go EOL
(Thanks Elena!). Susceptible to remote audio recording of PIN button
noise, which could be overcome by using 2FA. Again - what am I
protecting against?
</p>
</div>
</div>
<div id="outline-container-org5cc184c" class="outline-3">
<h3 id="org5cc184c"><span class="section-number-3">8.8.</span> Encrypted Filesystem</h3>
</div>
</div>
<div id="outline-container-org68c3946" class="outline-2">
<h2 id="org68c3946"><span class="section-number-2">9.</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgeab99d0" class="outline-3">
<h3 id="orgeab99d0"><span class="section-number-3">9.1.</span> sfz file tests</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-org632624b" class="outline-4">
<h4 id="org632624b"><span class="section-number-4">9.1.1.</span> need tooling to edit sample files</h4>
</div>
</div>
<div id="outline-container-org9b5a2a3" class="outline-3">
<h3 id="org9b5a2a3"><span class="section-number-3">9.2.</span> increasingly skeptical whether quality results are possible</h3>
</div>
<div id="outline-container-org1a14555" class="outline-3">
<h3 id="org1a14555"><span class="section-number-3">9.3.</span> maybe should treat as platform for concatinative synthesis</h3>
</div>
<div id="outline-container-org7637faf" class="outline-3">
<h3 id="org7637faf"><span class="section-number-3">9.4.</span> maybe should just accept the limitations and work with it</h3>
<div class="outline-text-3" id="text-9-4">
<p>
One should not be disappointed that a guitar can't sound like a flute.
</p>
</div>
</div>
</div>
<div id="outline-container-org33be7b3" class="outline-2">
<h2 id="org33be7b3"><span class="section-number-2">10.</span> gat</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org9b579f9" class="outline-3">
<h3 id="org9b579f9"><span class="section-number-3">10.1.</span> spectrogram done - matches 'octave' output</h3>
</div>
</div>
<div id="outline-container-org478a0db" class="outline-2">
<h2 id="org478a0db"><span class="section-number-2">11.</span> RIOT drivers</h2>
<div class="outline-text-2" id="text-11">
<p>
Implemented - needs testing.
</p>
</div>
<div id="outline-container-org002dd5d" class="outline-3">
<h3 id="org002dd5d"><span class="section-number-3">11.1.</span> WS2801</h3>
</div>
<div id="outline-container-orgb394b03" class="outline-3">
<h3 id="orgb394b03"><span class="section-number-3">11.2.</span> Velleman KA03</h3>
</div>
<div id="outline-container-org8009187" class="outline-3">
<h3 id="org8009187"><span class="section-number-3">11.3.</span> Velleman KA05</h3>
</div>
</div>
<div id="outline-container-org7646f39" class="outline-2">
<h2 id="org7646f39"><span class="section-number-2">12.</span> mcd05 32 button/led box</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org9ad4a54" class="outline-3">
<h3 id="org9ad4a54"><span class="section-number-3">12.1.</span> Recovered schematics.</h3>
</div>
<div id="outline-container-org00137c3" class="outline-3">
<h3 id="org00137c3"><span class="section-number-3">12.2.</span> Planning software.</h3>
</div>
<div id="outline-container-orgb4c551b" class="outline-3">
<h3 id="orgb4c551b"><span class="section-number-3">12.3.</span> Received STM32F767 Nucleo144 with Ethernet.</h3>
<div class="outline-text-3" id="text-12-3">
</div>
<div id="outline-container-org85d33fb" class="outline-4">
<h4 id="org85d33fb"><span class="section-number-4">12.3.1.</span> Test program running.</h4>
</div>
<div id="outline-container-org55f41c0" class="outline-4">
<h4 id="org55f41c0"><span class="section-number-4">12.3.2.</span> Need to consider CoAP multicast discovery.</h4>
</div>
<div id="outline-container-org9bf6f39" class="outline-4">
<h4 id="org9bf6f39"><span class="section-number-4">12.3.3.</span> Consider simpler architecture with STM32F767 as a 'hub'.</h4>
</div>
<div id="outline-container-org365a26e" class="outline-4">
<h4 id="org365a26e"><span class="section-number-4">12.3.4.</span> Consider CAN interface to hub.</h4>
</div>
</div>
</div>
<div id="outline-container-orge7189fd" class="outline-2">
<h2 id="orge7189fd"><span class="section-number-2">13.</span> AMD 2900 bitslice computing</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org9264855" class="outline-3">
<h3 id="org9264855"><span class="section-number-3">13.1.</span> Probably my oldest uncompleted project</h3>
</div>
<div id="outline-container-org9b3aa6f" class="outline-3">
<h3 id="org9b3aa6f"><span class="section-number-3">13.2.</span> Exploring possibilities for something constructive</h3>
<div class="outline-text-3" id="text-13-2">
<p>
Create verilog models for 2903/2910 and verify against hardware?
</p>
</div>
</div>
</div>
<div id="outline-container-org55d5ce3" class="outline-2">
<h2 id="org55d5ce3"><span class="section-number-2">14.</span> Hitachi HD68B09E CPU</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-org026984a" class="outline-3">
<h3 id="org026984a"><span class="section-number-3">14.1.</span> RAM/UART/IO</h3>
</div>
<div id="outline-container-orgc53c560" class="outline-3">
<h3 id="orgc53c560"><span class="section-number-3">14.2.</span> Started schematic</h3>
<div class="outline-text-3" id="text-14-2">
</div>
<div id="outline-container-orgd1e4d16" class="outline-4">
<h4 id="orgd1e4d16"><span class="section-number-4">14.2.1.</span> Standard peripheral set for 8 bit CPU bringups</h4>
<div class="outline-text-4" id="text-14-2-1">
<p>
Board schematic planned - need Kicad symbols
</p>
</div>
</div>
</div>
<div id="outline-container-orgecbc9b9" class="outline-3">
<h3 id="orgecbc9b9"><span class="section-number-3">14.3.</span> Arduino Mega 2560 DMA loader</h3>
<div class="outline-text-3" id="text-14-3">
<p>
&#x2026;Along with standard 8 bit loader
</p>
</div>
</div>
<div id="outline-container-orge470d43" class="outline-3">
<h3 id="orge470d43"><span class="section-number-3">14.4.</span> Generate quadrature clock directly</h3>
</div>
<div id="outline-container-org157506b" class="outline-3">
<h3 id="org157506b"><span class="section-number-3">14.5.</span> Full Bus SW Emulation infeasible</h3>
<div class="outline-text-3" id="text-14-5">
<p>
6809 1000ns maximum cycle time too short
</p>
</div>
</div>
</div>
<div id="outline-container-orge8ac6d2" class="outline-2">
<h2 id="orge8ac6d2"><span class="section-number-2">15.</span> Rockwell R65F11</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-orgd6d25ef" class="outline-3">
<h3 id="orgd6d25ef"><span class="section-number-3">15.1.</span> Still evaluating.</h3>
</div>
<div id="outline-container-org11f55c1" class="outline-3">
<h3 id="org11f55c1"><span class="section-number-3">15.2.</span> Dev board</h3>
<div class="outline-text-3" id="text-15-2">
<p>
Reverse engineered some of a mostly fully built development board with
one part missing. As near as I can tell, that one part is some sort of
programmable address decoder with a pinout that does not correspond to
any part I can find. Kind of like a GAL but with inputs on top and
outputs on bottom (as opposed to left and right in a standard GAL). I
have no idea what the provenance of this board is and if it ever
worked.
</p>
</div>
</div>
</div>
<div id="outline-container-org030f1c9" class="outline-2">
<h2 id="org030f1c9"><span class="section-number-2">16.</span> PLD programming</h2>
<div class="outline-text-2" id="text-16">
<p>
Looks like Atmel 16V8 is the last 5V PLD part left standing. Maybe not
surprising that there still doesn't appear to be a fully open source
tool chain for programming. How hard could it be? (!) Could next-pnr
generic help? Might be easier to use espresso for logic array and program
output logic bits directly for simple stuff.
</p>
</div>
</div>
<div id="outline-container-org25bdf4a" class="outline-2">
<h2 id="org25bdf4a"><span class="section-number-2">17.</span> EPROM Programming</h2>
<div class="outline-text-2" id="text-17">
<p>
Found some software for Needham programmer. Need to check electrolytic
caps on ISA board.
</p>
</div>
</div>
<div id="outline-container-org2f5f362" class="outline-2">
<h2 id="org2f5f362"><span class="section-number-2">18.</span> POSIT</h2>
<div class="outline-text-2" id="text-18">
<p>
Use POSITs for YRX?
</p>
</div>
</div>
<div id="outline-container-orge3fd864" class="outline-2">
<h2 id="orge3fd864"><span class="section-number-2">19.</span> MAME</h2>
<div class="outline-text-2" id="text-19">
</div>
<div id="outline-container-orgec42160" class="outline-3">
<h3 id="orgec42160"><span class="section-number-3">19.1.</span> Subset builds in debug mode</h3>
<div class="outline-text-3" id="text-19-1">
<p>
Full debug fails - not enough disk or memory.
</p>
</div>
</div>
<div id="outline-container-orgb2b9527" class="outline-3">
<h3 id="orgb2b9527"><span class="section-number-3">19.2.</span> gs6809 serial IO doesn't work right with PTY and other streams</h3>
</div>
<div id="outline-container-org52c0e25" class="outline-3">
<h3 id="org52c0e25"><span class="section-number-3">19.3.</span> ampro (Z80/Z80SIO) <b>does</b> work with PTY</h3>
</div>
<div id="outline-container-org36e9cd0" class="outline-3">
<h3 id="org36e9cd0"><span class="section-number-3">19.4.</span> Evaluating what is needed for other emulators.</h3>
</div>
</div>
<div id="outline-container-org7d4dbe6" class="outline-2">
<h2 id="org7d4dbe6"><span class="section-number-2">20.</span> More project ideas</h2>
<div class="outline-text-2" id="text-20">
</div>
<div id="outline-container-org1e906f5" class="outline-3">
<h3 id="org1e906f5"><span class="section-number-3">20.1.</span> Zuse Z3 simulation in Verilog</h3>
<div class="outline-text-3" id="text-20-1">
<p>
Good excuse for floating point ALU design. Try posit format?
</p>
</div>
</div>
<div id="outline-container-org75335fd" class="outline-3">
<h3 id="org75335fd"><span class="section-number-3">20.2.</span> GMPForth ports to simulators</h3>
<div class="outline-text-3" id="text-20-2">
</div>
<div id="outline-container-orgd3ca12a" class="outline-4">
<h4 id="orgd3ca12a"><span class="section-number-4">20.2.1.</span> SIMH for some targets (vax)</h4>
</div>
