status/src/2023/0630.org
*** MAME looks interesting for microprocessor system emulations
    How to support ersatz systems?
*** Ports to classic figFORTH targets
** GMPASM assembler
   May be useful for handbuilt and rare systems (DMX1000?).
** Extracting ISO Superboard Forth ROMS for MAME emulation
** 'bwocl' OpenCL tooling
*** Offline compilation
*** Standard Kernel Running
** hardware support for classic 5V CPUs
*** RTX2000, CDP1802 still available!
*** 6502, 68000, 320C30, others on hand
*** CPUs with totally async bus may be supportable without RAM
*** Could use small footprint monitor in asm (gmpmon?)
** Existing 'retro' hardware still working?
*** OSI Superboard
Unknown. Composite to VGA adapter didn't seem to work. Needs analysis.
Found OSI model 610 board underneath!
*** Super Jolt
No output. Needs analysis.
*** Ampro Little Board
Not booting. Needs analysis.
*** Rockwell R65F11 Demo board
UART sending "NO ROM" at 2400 7N1 as expected with 2MHz xtal.
MAME emulator possibilities?
*** NMIX-0016
Works. Found original prom in a parts stash(!).
* David Davies
** Broadcom BCG? Employee indicted for running a brothel.
** New case C1923172, consolidated with *15* Parties.
** Next hearing 6/20/2023
