status/2023/0630.html
<div id="outline-container-orga499546" class="outline-4">
<h4 id="orga499546"><span class="section-number-4">20.2.2.</span> MAME looks interesting for microprocessor system emulations</h4>
<div class="outline-text-4" id="text-20-2-2">
<p>
How to support ersatz systems?
</p>
</div>
</div>
<div id="outline-container-org3e653b2" class="outline-4">
<h4 id="org3e653b2"><span class="section-number-4">20.2.3.</span> Ports to classic figFORTH targets</h4>
</div>
</div>
<div id="outline-container-orga91eada" class="outline-3">
<h3 id="orga91eada"><span class="section-number-3">20.3.</span> GMPASM assembler</h3>
<div class="outline-text-3" id="text-20-3">
<p>
May be useful for handbuilt and rare systems (DMX1000?).
</p>
</div>
</div>
<div id="outline-container-org0d37e91" class="outline-3">
<h3 id="org0d37e91"><span class="section-number-3">20.4.</span> Extracting ISO Superboard Forth ROMS for MAME emulation</h3>
</div>
<div id="outline-container-org1f79a3b" class="outline-3">
<h3 id="org1f79a3b"><span class="section-number-3">20.5.</span> 'bwocl' OpenCL tooling</h3>
<div class="outline-text-3" id="text-20-5">
</div>
<div id="outline-container-orgc5ba745" class="outline-4">
<h4 id="orgc5ba745"><span class="section-number-4">20.5.1.</span> Offline compilation</h4>
</div>
<div id="outline-container-org9ce0264" class="outline-4">
<h4 id="org9ce0264"><span class="section-number-4">20.5.2.</span> Standard Kernel Running</h4>
</div>
</div>
<div id="outline-container-org4ec71c2" class="outline-3">
<h3 id="org4ec71c2"><span class="section-number-3">20.6.</span> hardware support for classic 5V CPUs</h3>
<div class="outline-text-3" id="text-20-6">
</div>
<div id="outline-container-org2e25e84" class="outline-4">
<h4 id="org2e25e84"><span class="section-number-4">20.6.1.</span> RTX2000, CDP1802 still available!</h4>
</div>
<div id="outline-container-org5358f8e" class="outline-4">
<h4 id="org5358f8e"><span class="section-number-4">20.6.2.</span> 6502, 68000, 320C30, others on hand</h4>
</div>
<div id="outline-container-orgbeb4556" class="outline-4">
<h4 id="orgbeb4556"><span class="section-number-4">20.6.3.</span> CPUs with totally async bus may be supportable without RAM</h4>
</div>
<div id="outline-container-org06e6c89" class="outline-4">
<h4 id="org06e6c89"><span class="section-number-4">20.6.4.</span> Could use small footprint monitor in asm (gmpmon?)</h4>
</div>
</div>
<div id="outline-container-org4e0742c" class="outline-3">
<h3 id="org4e0742c"><span class="section-number-3">20.7.</span> Existing 'retro' hardware still working?</h3>
<div class="outline-text-3" id="text-20-7">
</div>
<div id="outline-container-org44d0515" class="outline-4">
<h4 id="org44d0515"><span class="section-number-4">20.7.1.</span> OSI Superboard</h4>
<div class="outline-text-4" id="text-20-7-1">
<p>
Unknown. Composite to VGA adapter didn't seem to work. Needs analysis.
Found OSI model 610 board underneath!
</p>
</div>
</div>
<div id="outline-container-orgac44ffa" class="outline-4">
<h4 id="orgac44ffa"><span class="section-number-4">20.7.2.</span> Super Jolt</h4>
<div class="outline-text-4" id="text-20-7-2">
<p>
No output. Needs analysis.
</p>
</div>
</div>
<div id="outline-container-org548dabd" class="outline-4">
<h4 id="org548dabd"><span class="section-number-4">20.7.3.</span> Ampro Little Board</h4>
<div class="outline-text-4" id="text-20-7-3">
<p>
Not booting. Needs analysis.
</p>
</div>
</div>
<div id="outline-container-org1a2f127" class="outline-4">
<h4 id="org1a2f127"><span class="section-number-4">20.7.4.</span> Rockwell R65F11 Demo board</h4>
<div class="outline-text-4" id="text-20-7-4">
<p>
UART sending "NO ROM" at 2400 7N1 as expected with 2MHz xtal.
MAME emulator possibilities?
</p>
</div>
</div>
<div id="outline-container-orga8db964" class="outline-4">
<h4 id="orga8db964"><span class="section-number-4">20.7.5.</span> NMIX-0016</h4>
<div class="outline-text-4" id="text-20-7-5">
<p>
Works. Found original prom in a parts stash(!).
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org8f4d9f2" class="outline-2">
<h2 id="org8f4d9f2"><span class="section-number-2">21.</span> David Davies</h2>
<div class="outline-text-2" id="text-21">
</div>
<div id="outline-container-orgb232b5b" class="outline-3">
<h3 id="orgb232b5b"><span class="section-number-3">21.1.</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-orgf5b7986" class="outline-3">
<h3 id="orgf5b7986"><span class="section-number-3">21.2.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-org73249d8" class="outline-3">
<h3 id="org73249d8"><span class="section-number-3">21.3.</span> Next hearing 6/20/2023</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-07-01 Sat 09:58</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
